<?php
global $Text;
global $plans; 


//Message Section
$Text['message']['welcome'] = 'سلام دوست عزیز . به بزرگترین بات فروش سرویس VPN خوش امدید❤️

▫️▫️▫️▫️▫️▫️▫️▫️▫️

اینجا میتونی سرویس های VPN با 💁‍♂ گارانتی بازگشت وجه دریافت کنی

✅بعد از دریافت سرویس های ما ٫ تنها وظیفه ما کانکت نگه داشتن شما به اینترنت ازاده.

❗️درصورت بروز هرگونه مشکلی سرور ها سریع جایگزین میشن و براتون ارسال میشند . (همزمان کلی سرور بکاپ اماده داریم)';

$Text['message']['contact'] = 'در صورت بروز هر مشکلی و نیاز به ارتباط با پشتیبانی فقط کافیه به ایدی زیر پیام دهید .(24 ساعته در خدمت شماییم)

🆔 @virahelp

—————————————————
حتما برای با خبر شدن از آخرین اطلاعیه ها در کانال ما عضو شوید .';

$Text['message']['operator'] = "
🔴 اپراتور خود را انتخاب کنید 

";
$Text['message']['info'] = "


✅تمامی سرویس ها روی اندروید , IOS ,ویندوز و تمامی سیستم عامل ها قابل اجرا هستن .

✅سرویس های ما طوری طراحی شدند که زمان اتصال شما همواره پایدار باشد  و مشکل قطعی نداشته باشید .

✅در صورت بروز هرگونه مشکل سرور های جایگزین وارد مدار می شوند و شما مشکل قطعی نخواهید داشت . 

";
$Text['message']['sell_title'] = "
🔻🔻 پلن مصرفی خود را انتخاب کنید : 🔻🔻
";

$Text['message']['success'] = "
پرداخت با موفقیت انجام شد .
";

$Text['message']['waiting'] = "
موجودی کیف پول شما کافی نیست ...
";
$Text['message']['payment']['enough_balance'] = "✅ موجودی شما کافی می باشد

برای پرداخت فقط کافیست روی تایید پرداخت کلیک نمایید . ";

$Text['message']['payment']['low_balance'] = "❌متاسفانه اعتبار کافی برای فعال سازی سرویس انتخاب را ندارید . برای خرید سرویس فقط کافیست روی افزایش اعتبار کلیک کنید . 

پرداخت توسط درگاه پرداخت امن انجام می شود فقط ابتدا کافیست با شماره تلفن خود وارد سایت شوید . 

⛔️برای افزایش امنیت پرداخت حتما شماره تلفنی که وارد سایت می شوید با صاحب شماره کارت پرداختی باید یکسان باشد . 

درصورتی که هرگونه مشکلی در پرداخت داشتید با مشاورین ما در ارتباط باشید . ";

$Text['message']['payment']['decline'] = "❌شما موجودی کافی برای تایید پرداخت ندارید❌


ابتدا باید روی افزایش اعتبار کلیک کرده سپس با استفاده از دکمه ی تایید پرداخت اشتراک خود را فعال نمایید .

";

$Text['message']['payment']['accepted'] = "
✅  کانفیگ شما با موفقیت افزوده شد . برای آموزش اتصال به کانفیگ میتونید از آموزش موجود درمنوی اصلی بات یا ویدیو های کانال استفاده نمایید .
";

$Text['message']['config']['failed'] = "
افزودن کانفیگ با خطا همراه بود . لطفا با پشتیبانی تماس حاصل نمایید .
";

$Text['message']['test']['menu'] = "
برای سرور  تست فقط یک سرور 🇫🇮 فنلاند موجود می باشد . 

🔻در ماه فقط یکبار مجاز به دریافت سرور تست می باشید . 

🎈زمان استفاده : 1 ساعت
🎈حجم : 500 مگابایت

برای دریافت از منوی زیر استفاده کنید . (کانفیگ های اصلی روی سرور های خلوت و بهتری ارائه می شوند )
";

$Text['message']['help']['buy'] = "
آموزش خرید از ربات :

✅ابتدا روی /start کلیک کنید .

✅ از منو باز شده رو خرید سرویس کلیک کنید . 

✅ پلن مورد نظر خود را انتخاب کنید .

✅ روی افزایش اعتبار کلیک کنید و وارد سایت شوید . در این مرحله حتما باید با شماره تلفن و شماره کارتی که به اسم شماست وارد سایت شوید . 

✅ بعد از اضافه کردن کارت بانکی به صفحه تایید پرداخت منتقل می شوید . 

✅ پس از تایید مشخصات رو خرید کلیک کنید و وارد درگاه پرداخت شاپرک می شوید . 

✅ پرداخت خود را تکمیل کنید و پس از دیدن صفحه ی موفقیت , وارد بات شده و روی تایید پرداخت کلیک کنید . 

💎سفارش شما اتوماتیک تایید شده و کانفیگ فورا توسط ربات برای شما ارسال خواهد شد . 

در صورت بروز هرگونه مشکل با ایدی زیر در ارتباط باشید :

@virahelp
";




//Button Section


$Text['button']['buy'] = '🛒 خرید سرویس VPN';
$Text['button']['services'] = '📡 سرویس های من';
$Text['button']['test'] = '🛎 تست ۶۰ دقیقه ای';
$Text['button']['channels'] = '🔔 کانال اطلاع رسانی';
$Text['button']['contact'] = '👤 ارتباط با پشتیبانی';
$Text['button']['back'] = 'بازگشت';
$Text['button']['irancel'] = 'ایرانسل \ رایتل و ...';
$Text['button']['hamrah'] = 'همراه اول \ نت خونگی';
$Text['button']['pay'] = 'پرداخت با ارزدیجیتال';
$Text['button']['raseFund'] = '💳 افزایش اعتبار';
$Text['button']['checkTransAction'] = '✅ تایید پرداخت';
$Text['button']['buyhelp'] = '⚠️ راهنمای خرید و پرداخت';

$Text['button']['plan1'] = "۵۰ گیگ | یک ماه | تک کاربره | 98 هزار تومان";
$Text['button']['plan2'] = "۶۰ گیگ | یک ماه | دو کاربره | 165 هزارتومان";
$Text['button']['plan3'] = "۱۲۰ گیگ | یک ماه | ۴ کاربره | 298 هزارتومان";
$plans = [
    'trx' =>[
        "const" =>3670
    ],
    1 =>
        [
            "title" => $Text['button']['plan1'],
            "duration" => 1, //month
            "user" => 1,
            "price" => '98 هزارتومان',
            "tron" => 24,
            "usage" => 50
        ],
    2 =>
        [
            "title" => $Text['button']['plan2'],
            "duration" => 1,
            "user" => 2,
            "price" => '165 هزارتومان',
            "tron" => 42,
            "usage" => 60
        ],
    3 =>
        [
            "title" => $Text['button']['plan3'],
            "duration" => 1,
            "user" => 4,
            "price" => '298 هزارتومان',
            "tron" => 77,
            "usage" => 120
        ],
];

?>